# HP_ConvertToHangPos

## Description
Invkoes the Convert To Hanging Position menu command on the systems of the selected objects.

```pascal
PROCEDURE HP_ConvertToHangPos;
```

```python
def vs.HP_ConvertToHangPos():
    return None
```

## Examples
```pascal
HP_ConvertToHangPos;
```
```python
import vs

# Invkoes the Convert To Hanging Position menu command on the systems of the
# selected objects.
vs.HP_ConvertToHangPos()
```

## Version
Availability: from Vectorworks 2019

## Category
* Truss Analysis